# 'brew tap'
tap "blackfireio/homebrew-blackfire"
tap "box-project/box"

# 'brew install'
brew "lsd" # https://github.com/lsd-rs/lsd
brew "bat" # https://github.com/sharkdp/bat
brew "git-delta" # https://github.com/dandavison/delta
brew "act" # https://github.com/nektos/act
brew "gh" # https://github.com/cli/cli
brew "hub" # https://github.com/mislav/hub
brew "gnupg" # https://github.com/gpg/gnupg
brew "docker" # https://github.com/docker/cli
brew "docker-completion" # https://github.com/docker/cli
brew "marp-cli" # https://github.com/marp-team/marp-cli
brew "starship" # https://github.com/starship/starship
brew "php" # https://github.com/php/php-src
brew "composer" # https://github.com/composer/composer
brew "symfony-cli/tap/symfony-cli" # https://github.com/symfony-cli/symfony-cli
brew "node" # https://github.com/nodejs/node
brew "pnpm" # https://github.com/pnpm/pnpm
brew "ansible" # https://github.com/ansible/ansible
brew "topgrade" # https://github.com/topgrade-rs/topgrade
brew "zsh-autosuggestions" # https://github.com/zsh-users/zsh-autosuggestions
brew "zsh-fast-syntax-highlighting" # https://github.com/zdharma-continuum/fast-syntax-highlighting
brew "zsh-vi-mode" # https://github.com/jeffreytse/zsh-vi-mode
brew "box-project/box/box" # https://github.com/box-project/box
brew "asciinema" # https://github.com/asciinema/asciinema
brew "tree" # https://github.com/Old-Man-Programmer/tree
brew "mkcert" # https://github.com/FiloSottile/mkcert
brew "nss" # https://github.com/nss-dev/nss

# 'brew install --cask'
cask "docker-desktop" # https://github.com/docker/for-mac
cask "brave-browser" # https://github.com/brave/brave-browser
cask "brave-browser@beta" # https://github.com/brave/brave-browser
cask "firefox" # https://github.com/mozilla/firefox
cask "bitwarden" # https://github.com/bitwarden/clients
cask "iterm2" # https://github.com/gnachman/iTerm2
cask "webstorm" # https://github.com/JetBrains/intellij-community
cask "phpstorm" # https://github.com/JetBrains/intellij-community
cask "insomnia" # https://github.com/Kong/insomnia
cask "rectangle" # https://github.com/rxhanson/Rectangle
cask "slack" # https://github.com/slackhq/slack-desktop
cask "claude" # https://claude.ai
cask "sublime-text" # https://github.com/sublimehq/sublime_text
cask "superwhisper" # https://superwhisper.com
cask "the-unarchiver" # https://github.com/MacPaw/XADMaster
cask "font-hack-nerd-font" # https://github.com/ryanoasis/nerd-fonts
