# 'brew tap'
tap "box-project/box"
tap "dahlia/jetbrains-eap"

# 'brew install'
brew "lsd"
brew "bat"
brew "git"
brew "git-delta"
brew "act"
brew "gh"
brew "hub"
brew "gnupg"
brew "docker"
brew "docker-completion"
brew "marp-cli"
brew "starship"
brew "php"
brew "composer"
brew "symfony-cli/tap/symfony-cli"
brew "node"
brew "pnpm"
brew "ansible"
brew "topgrade"
brew "zsh-autosuggestions"
brew "zsh-fast-syntax-highlighting"
brew "zsh-vi-mode"
brew "box"
brew "asciinema"
brew "tree"

# 'brew install --cask'
cask "firefox"
cask "firefox@developer-edition"
cask "bitwarden"
cask "docker"
cask "iterm2"
cask "phpstorm"
cask "postman"
cask "rectangle"
cask "slack"
cask "cursor"
cask "sublime-text"
cask "zed"
cask "the-unarchiver"
cask "font-hack-nerd-font"
